jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324xx_eval_lcd.c
/**
  ******************************************************************************
  * @file    stm324xg_eval_lcd.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    30-September-2012
  * @brief   This file includes the LCD driver for AM480272H3TMQW-T01H 
  *          and AM640480G5TNQW-T00H Liquid Crystal Display Modules
  *          of STM324xG-EVAL evaluation board(MB786) RevB.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  ******************************************************************************  
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm324xx_eval_lcd.h"
#include "fmc_sdram.h"

/** @addtogroup Utilities
  * @{
  */ 

/** @addtogroup STM32_EVAL
  * @{
  */ 

/** @addtogroup STM324xG_EVAL
  * @{
  */
    
/** @defgroup STM324xG_EVAL_LCD 
  * @brief This file includes the LCD driver for AM480272H3TMQW-T01H 
  *        and AM640480G5TNQW-T00H Liquid Crystal Display Modules
  *        of STM324xG_EVAL board.
  * @{
  */ 

/** @defgroup STM324xG_EVAL_LCD_Private_TypesDefinitions
  * @{
  */ 

/**
  * @}
  */ 

/** @defgroup STM324xG_EVAL_LCD_Private_Defines
  * @{
  */

#define MAX_POLY_CORNERS   200
#define POLY_X(Z)          ((int32_t)((Points + Z)->X))
#define POLY_Y(Z)          ((int32_t)((Points + Z)->Y))
uint32_t Bank1_SDRAM_ADDRESS = 0xC0000000;
uint16_t LCD_PIXEL_WIDTH  = 0x01E0;
uint16_t LCD_PIXEL_HEIGHT = 0x0110;
uint32_t XADDRESS = 0;

/**
  * @}
  */ 

/** @defgroup STM324xG_EVAL_LCD_Private_Macros
  * @{
  */
#define ABS(X)  ((X) > 0 ? (X) : -(X))     
/**
  * @}
  */ 
    
/** @defgroup STM324xG_EVAL_LCD_Private_Variables
  * @{
  */ 
static sFONT *LCD_Currentfonts;

  /* Global variables to set the written text color */
static __IO uint16_t TextColor = 0x0000, BackColor = 0xFFFF;
static __IO uint32_t Layer = 0x0000;
  
/**
  * @}
  */ 


/** @defgroup STM324xG_EVAL_LCD_Private_FunctionPrototypes
  * @{
  */ 
#ifndef USE_Delay
static void delay(__IO uint32_t nCount);
#endif /* USE_Delay*/
void FMC_SDRAM_LCD_GPIOConfig(void);
static void PutPixel(int16_t x, int16_t y);
static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed);


/**
  * @}
  */ 


/** @defgroup STM324xG_EVAL_LCD_Private_Functions
  * @{
  */ 

/**
  * @brief  DeInitializes the LCD.
  * @param  None
  * @retval None
  */
void LCD_DeInit(void)
{ 
  GPIO_InitTypeDef GPIO_InitStructure;

  /*!< LCD Display Off */
  LCD_DisplayOff();
   
/*-- GPIO Configuration ------------------------------------------------------*/
  /* GPIOD configuration */
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource0, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource1, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource3, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource4, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource5, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource6, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource7, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource10, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource11, GPIO_AF_MCO); 
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource12, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource13, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_MCO);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_3  | GPIO_Pin_4  |
                                GPIO_Pin_5  | GPIO_Pin_6  | GPIO_Pin_7  | GPIO_Pin_8  |
                                GPIO_Pin_9  | GPIO_Pin_10 | GPIO_Pin_11 |GPIO_Pin_12  | 
                                GPIO_Pin_13 |GPIO_Pin_14  | GPIO_Pin_15;
  
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;

  GPIO_Init(GPIOD, &GPIO_InitStructure);


  /* GPIOE configuration */
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource0 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource1 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource3 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource4 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource6 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource8 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource9 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource10 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource11 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource12 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource13 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource14 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource15 , GPIO_AF_MCO);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_2  | GPIO_Pin_3 |  
                                GPIO_Pin_4  | GPIO_Pin_5  | GPIO_Pin_6  | GPIO_Pin_7 |
                                GPIO_Pin_8  | GPIO_Pin_9  | GPIO_Pin_10 | GPIO_Pin_11|
                                GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;

  GPIO_Init(GPIOE, &GPIO_InitStructure);


  /* GPIOF configuration */
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource0 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource1 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource3 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource4 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource6 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource8 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource9 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource10 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource11 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource12 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource13 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource14 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOF, GPIO_PinSource15 , GPIO_AF_MCO);

