jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324xx_eval_lcd.c
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_2  | GPIO_Pin_3  | 
                                GPIO_Pin_4  | GPIO_Pin_5  | GPIO_Pin_6  | GPIO_Pin_7  | 
                                GPIO_Pin_8  | GPIO_Pin_9  | GPIO_Pin_11 | GPIO_Pin_10 |
                                GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;      

  GPIO_Init(GPIOF, &GPIO_InitStructure);


  /* GPIOG configuration */
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource0 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource1 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource3 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource4 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource6 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource8 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource9 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource10 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource11 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource12 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource13 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource14 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource15 , GPIO_AF_MCO);
  

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0  | GPIO_Pin_1  | GPIO_Pin_2  | GPIO_Pin_3 | 
                                GPIO_Pin_4  | GPIO_Pin_5  | GPIO_Pin_6  | GPIO_Pin_7 |
                                GPIO_Pin_8  | GPIO_Pin_9  | GPIO_Pin_10 | GPIO_Pin_11|
                                GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;        

  GPIO_Init(GPIOG, &GPIO_InitStructure);
  
  
  /* GPIOH configuration */
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource3 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource6 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource8 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource9 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource10 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource11 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource12 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource13 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource14 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOH, GPIO_PinSource15 , GPIO_AF_MCO);
  

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2  | GPIO_Pin_3  | GPIO_Pin_5  | GPIO_Pin_6  |
                                GPIO_Pin_7  | GPIO_Pin_8  | GPIO_Pin_9  | GPIO_Pin_10 |
                                GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 |  
                                GPIO_Pin_15;      

  GPIO_Init(GPIOH, &GPIO_InitStructure);

  /* GPIOI configuration */
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource0 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource1 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource2 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource3 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource4 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource5 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource6 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource7 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource9 , GPIO_AF_MCO);
  GPIO_PinAFConfig(GPIOI, GPIO_PinSource10 , GPIO_AF_MCO);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | 
                                GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 |
                                GPIO_Pin_9 | GPIO_Pin_10;      

  GPIO_Init(GPIOI, &GPIO_InitStructure); 
}

/**
  * @brief  Initializes the LCD AM_640x480.
  * @param  None
  * @retval None
  */
void STM324xx_LCD_AM640480G5TNQW_Init(void)
{ 
  
  LTDC_InitTypeDef       LTDC_InitStruct;
  LTDC_Layer_InitTypeDef LTDC_Layer_InitStruct;
  LTDC_Layer_TypeDef     LTDC_Layerx;

/* LCD Size (Width and Height) */  
LCD_PIXEL_WIDTH  = 0x0280; /* 640 */
LCD_PIXEL_HEIGHT = 0x01E0; /* 480 */
  
/* Configure the LCD Control pins --------------------------------------------*/
  LCD_AF_GPIOConfig();  

/* Configure the FSMC Parallel interface -------------------------------------*/
  LCD_FMCConfig();
  
  /* Configure PLLSAI prescalers for SRAM */
  
  /* Enbale Pixel Clock */
  /* Configure PLLSAI prescalers */
  RCC_PLLSAIConfig(192, 7, 5);
  RCC_LCDCLKDivConfig(RCC_PLLSAIDivR_Div16);
  
  /* Enable PLLSAI Clock */
  RCC_PLLSAICmd(ENABLE);
  /* Wait for PLLSAI activation */
  while(RCC_GetFlagStatus(RCC_FLAG_PLLSAIRDY) == RESET)
  {
  }

  GPIO_SetBits(GPIOH, GPIO_Pin_11);
  
  LTDC_InitStruct.LTDC_HSPolarity = LTDC_HSPolarity_AL;      /*!< Initialize the LTDC_HSPolarity member */ 
  LTDC_InitStruct.LTDC_VSPolarity = LTDC_VSPolarity_AL;      /*!< Initialize the LTDC_VSPolarity member */
  LTDC_InitStruct.LTDC_DEPolarity = LTDC_DEPolarity_AL;      /*!< Initialize the LTDC_DEPolarity member */
  LTDC_InitStruct.LTDC_PCPolarity = LTDC_PCPolarity_IPC;     /*!< Initialize the LTDC_PCPolarity member */
  LTDC_InitStruct.LTDC_HorizontalSync = 0x28;                /*!< Initialize the LTDC_HorizontalSync member */
  LTDC_InitStruct.LTDC_VerticalSync = 0x09;                  /*!< Initialize the LTDC_VerticalSync member */
  LTDC_InitStruct.LTDC_AccumulatedHBP = 0x2A;                /*!< Initialize the LTDC_AccumulatedHBP member */
  LTDC_InitStruct.LTDC_AccumulatedVBP = 0x0B;                /*!< Initialize the LTDC_AccumulatedVBP member */
  LTDC_InitStruct.LTDC_AccumulatedActiveW = 0x20A;           /*!< Initialize the LTDC_AccumulatedActiveW member */
  LTDC_InitStruct.LTDC_AccumulatedActiveH = 0x11B;           /*!< Initialize the LTDC_AccumulatedActiveH member */
  LTDC_InitStruct.LTDC_TotalWidth = 0x20C;                   /*!< Initialize the LTDC_TotalWidth member */
  LTDC_InitStruct.LTDC_TotalHeigh = 0x11D;                   /*!< Initialize the LTDC_TotalHeigh member */
  LTDC_InitStruct.LTDC_BackgroundRedValue = 0x00;            /*!< Initialize the LTDC_BackgroundRedValue member */
  LTDC_InitStruct.LTDC_BackgroundGreenValue = 0x00;          /*!< Initialize the LTDC_BackgroundGreenValue member */
  LTDC_InitStruct.LTDC_BackgroundBlueValue = 0x00;           /*!< Initialize the LTDC_BackgroundBlueValue member */
  LTDC_Init(&LTDC_InitStruct);
  
 if (Layer == LCD_Layer1)
  {   
  LTDC_Layer_InitStruct.LTDC_HorizontalStart = 0x2B;
  LTDC_Layer_InitStruct.LTDC_HorizontalStop = (LCD_PIXEL_WIDTH + 0x2B - 1); 
  LTDC_Layer_InitStruct.LTDC_VarticalStart = 0x0C;
  LTDC_Layer_InitStruct.LTDC_VerticalStop = (LCD_PIXEL_HEIGHT + 0x0C - 1);           
  LTDC_Layer_InitStruct.LTDC_PixelFormat = LTDC_Pixelformat_RGB565;
  LTDC_Layer_InitStruct.LTDC_ConstantAlpha = 0xFF;           
  LTDC_Layer_InitStruct.LTDC_DefaultColorBlue = 0x00;        
  LTDC_Layer_InitStruct.LTDC_DefaultColorGreen = 0x00;       
  LTDC_Layer_InitStruct.LTDC_DefaultColorRed = 0x00;         
  LTDC_Layer_InitStruct.LTDC_DefaultColorAlpha = 0x00;       
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_CA;    
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_CA;    
  LTDC_Layer_InitStruct.LTDC_CFBStartAdress = 0xC0000000;
  LTDC_Layer_InitStruct.LTDC_CFBLineLength = ((LCD_PIXEL_WIDTH * 2) + 3); 
  LTDC_Layer_InitStruct.LTDC_CFBPitch = (LCD_PIXEL_WIDTH * 2);  
  LTDC_Layer_InitStruct.LTDC_CFBLineNumber = LCD_PIXEL_HEIGHT; 
  LTDC_LayerInit(LTDC_Layer1, &LTDC_Layer_InitStruct);
  }
  else
  { 
  LTDC_Layer_InitStruct.LTDC_HorizontalStart = 0x2B;
  LTDC_Layer_InitStruct.LTDC_HorizontalStop = (LCD_PIXEL_WIDTH + 0x2B - 1); 
  LTDC_Layer_InitStruct.LTDC_VarticalStart = 0x0C;
  LTDC_Layer_InitStruct.LTDC_VerticalStop = (LCD_PIXEL_HEIGHT + 0x0C - 1);           
  LTDC_Layer_InitStruct.LTDC_PixelFormat = LTDC_Pixelformat_RGB565;
  LTDC_Layer_InitStruct.LTDC_ConstantAlpha = 0xFF;           
  LTDC_Layer_InitStruct.LTDC_DefaultColorBlue = 0x00;        
  LTDC_Layer_InitStruct.LTDC_DefaultColorGreen = 0x00;       
  LTDC_Layer_InitStruct.LTDC_DefaultColorRed = 0x00;         
  LTDC_Layer_InitStruct.LTDC_DefaultColorAlpha = 0x00;       
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_CA;    
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_CA;    
  LTDC_Layer_InitStruct.LTDC_CFBStartAdress = 0xC00A0000;
  LTDC_Layer_InitStruct.LTDC_CFBLineLength = ((LCD_PIXEL_WIDTH * 2) + 3); 
  LTDC_Layer_InitStruct.LTDC_CFBPitch = (LCD_PIXEL_WIDTH * 2);  
  LTDC_Layer_InitStruct.LTDC_CFBLineNumber = LCD_PIXEL_HEIGHT;   
  LTDC_LayerInit(LTDC_Layer2, &LTDC_Layer_InitStruct);
  }

  
  LCD_SetFont(&LCD_DEFAULT_FONT);
}

/**
  * @brief  Initializes the LCD AM_480x272.
  * @param  None
  * @retval None
  */
void STM324xx_LCD_AM480272H3TMQW_Init(void)
{ 
  
