jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324xx_eval_lcd.c
  LTDC_InitTypeDef       LTDC_InitStruct;
  LTDC_Layer_InitTypeDef LTDC_Layer_InitStruct;
  LTDC_Layer_TypeDef     LTDC_Layerx;
  
/* LCD Size (Width and Height) */  
 LCD_PIXEL_WIDTH  = 0x01E0; /* 480 */
 LCD_PIXEL_HEIGHT = 0x0110; /* 272 */  
  
/* Configure the LCD Control pins --------------------------------------------*/
  LCD_AF_GPIOConfig();  

/* Configure the FSMC Parallel interface -------------------------------------*/
  LCD_FMCConfig();
  
  /* Configure PLLSAI prescalers for SRAM */
  
  /* Enbale Pixel Clock */
  /* Configure PLLSAI prescalers */
  RCC_PLLSAIConfig(192, 7, 5);
  RCC_LCDCLKDivConfig(RCC_PLLSAIDivR_Div16);
  
  /* Enable PLLSAI Clock */
  RCC_PLLSAICmd(ENABLE);
  /* Wait for PLLSAI activation */
  while(RCC_GetFlagStatus(RCC_FLAG_PLLSAIRDY) == RESET)
  {
  }

  GPIO_SetBits(GPIOH, GPIO_Pin_11);
  
  LTDC_InitStruct.LTDC_HSPolarity = LTDC_HSPolarity_AL;      /*!< Initialize the LTDC_HSPolarity member */ 
  LTDC_InitStruct.LTDC_VSPolarity = LTDC_VSPolarity_AL;      /*!< Initialize the LTDC_VSPolarity member */
  LTDC_InitStruct.LTDC_DEPolarity = LTDC_DEPolarity_AL;      /*!< Initialize the LTDC_DEPolarity member */
  LTDC_InitStruct.LTDC_PCPolarity = LTDC_PCPolarity_IPC;     /*!< Initialize the LTDC_PCPolarity member */
  LTDC_InitStruct.LTDC_HorizontalSync = 0x28;                /*!< Initialize the LTDC_HorizontalSync member */
  LTDC_InitStruct.LTDC_VerticalSync = 0x09;                  /*!< Initialize the LTDC_VerticalSync member */
  LTDC_InitStruct.LTDC_AccumulatedHBP = 0x2A;                /*!< Initialize the LTDC_AccumulatedHBP member */
  LTDC_InitStruct.LTDC_AccumulatedVBP = 0x0B;                /*!< Initialize the LTDC_AccumulatedVBP member */
  LTDC_InitStruct.LTDC_AccumulatedActiveW = 0x20A;           /*!< Initialize the LTDC_AccumulatedActiveW member */
  LTDC_InitStruct.LTDC_AccumulatedActiveH = 0x11B;           /*!< Initialize the LTDC_AccumulatedActiveH member */
  LTDC_InitStruct.LTDC_TotalWidth = 0x20C;                   /*!< Initialize the LTDC_TotalWidth member */
  LTDC_InitStruct.LTDC_TotalHeigh = 0x11D;                   /*!< Initialize the LTDC_TotalHeigh member */
  LTDC_InitStruct.LTDC_BackgroundRedValue = 0x00;            /*!< Initialize the LTDC_BackgroundRedValue member */
  LTDC_InitStruct.LTDC_BackgroundGreenValue = 0x00;          /*!< Initialize the LTDC_BackgroundGreenValue member */
  LTDC_InitStruct.LTDC_BackgroundBlueValue = 0x00;           /*!< Initialize the LTDC_BackgroundBlueValue member */
  LTDC_Init(&LTDC_InitStruct);
  
 if (Layer == LCD_Layer1)
  {   
  LTDC_Layer_InitStruct.LTDC_HorizontalStart = 0x2B;
  LTDC_Layer_InitStruct.LTDC_HorizontalStop = (LCD_PIXEL_WIDTH + 0x2B - 1); 
  LTDC_Layer_InitStruct.LTDC_VarticalStart = 0x0C;
  LTDC_Layer_InitStruct.LTDC_VerticalStop = (LCD_PIXEL_HEIGHT + 0x0C - 1);           
  LTDC_Layer_InitStruct.LTDC_PixelFormat = LTDC_Pixelformat_RGB565;
  LTDC_Layer_InitStruct.LTDC_ConstantAlpha = 0xFF;           
  LTDC_Layer_InitStruct.LTDC_DefaultColorBlue = 0x00;        
  LTDC_Layer_InitStruct.LTDC_DefaultColorGreen = 0x00;       
  LTDC_Layer_InitStruct.LTDC_DefaultColorRed = 0x00;         
  LTDC_Layer_InitStruct.LTDC_DefaultColorAlpha = 0x00;       
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_CA;    
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_CA;    
  LTDC_Layer_InitStruct.LTDC_CFBStartAdress = 0xC0000000;
  LTDC_Layer_InitStruct.LTDC_CFBLineLength = ((LCD_PIXEL_WIDTH * 2) + 3); 
  LTDC_Layer_InitStruct.LTDC_CFBPitch = (LCD_PIXEL_WIDTH * 2);  
  LTDC_Layer_InitStruct.LTDC_CFBLineNumber = LCD_PIXEL_HEIGHT; 
  LTDC_LayerInit(LTDC_Layer1, &LTDC_Layer_InitStruct);
  }
  else
  { 
  LTDC_Layer_InitStruct.LTDC_HorizontalStart = 0x2B;
  LTDC_Layer_InitStruct.LTDC_HorizontalStop = (LCD_PIXEL_WIDTH + 0x2B - 1); 
  LTDC_Layer_InitStruct.LTDC_VarticalStart = 0x0C;
  LTDC_Layer_InitStruct.LTDC_VerticalStop = (LCD_PIXEL_HEIGHT + 0x0C - 1);           
  LTDC_Layer_InitStruct.LTDC_PixelFormat = LTDC_Pixelformat_RGB565;
  LTDC_Layer_InitStruct.LTDC_ConstantAlpha = 0xFF;           
  LTDC_Layer_InitStruct.LTDC_DefaultColorBlue = 0x00;        
  LTDC_Layer_InitStruct.LTDC_DefaultColorGreen = 0x00;       
  LTDC_Layer_InitStruct.LTDC_DefaultColorRed = 0x00;         
  LTDC_Layer_InitStruct.LTDC_DefaultColorAlpha = 0x00;       
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_CA;    
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_CA;    
  LTDC_Layer_InitStruct.LTDC_CFBStartAdress = 0xC00A0000;
  LTDC_Layer_InitStruct.LTDC_CFBLineLength = ((LCD_PIXEL_WIDTH * 2) + 3); 
  LTDC_Layer_InitStruct.LTDC_CFBPitch = (LCD_PIXEL_WIDTH * 2);  
  LTDC_Layer_InitStruct.LTDC_CFBLineNumber = LCD_PIXEL_HEIGHT;   
  LTDC_LayerInit(LTDC_Layer2, &LTDC_Layer_InitStruct);
  }
  
  LCD_SetFont(&LCD_DEFAULT_FONT);
}


/**
  * @brief  Sets the LCD Layer.
  * @param  _Layer: specifies the Layer.
  * @retval None
  */
void LCD_SetLayer(__IO uint32_t _Layer)
{
  Layer = _Layer; 
}

/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
  TextColor = _TextColor; 
  BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text 
            Color.
  * @param  _BackColor: pointer to the variable that will contain the Background 
            Color.
  * @retval None
  */
void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
  *_TextColor = TextColor; *_BackColor = BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
  TextColor = Color;
}


/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
  BackColor = Color;
}

/**
  * @brief  Sets the Text Font.
  * @param  fonts: specifies the font to be used.
  * @retval None
  */
void LCD_SetFont(sFONT *fonts)
{
  LCD_Currentfonts = fonts;
}

/**
  * @brief  Gets the Text Font.
  * @param  None.
  * @retval the used font.
  */
sFONT *LCD_GetFont(void)
{
  return LCD_Currentfonts;
}

/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void LCD_ClearLine(uint16_t Line)
{
  uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;
  /* Send the string character by character on lCD */
  while (((refcolumn + 1)& 0xFFFF) >= LCD_Currentfonts->Width)
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Line, refcolumn, ' ');
    /* Decrement the column position by 16 */
    refcolumn -= LCD_Currentfonts->Width;
  }
}

/**
  * @brief  Clears the hole LCD.
  * @param  Color: the color of the background.
  * @retval None
  */
void LCD_Clear(uint16_t Color)
{
  uint32_t index = 0;
  
