jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324xx_eval_lcd.c
    /* erase memory */
  for (index = 0x00; index < 655360; index++)
  {
    *(__IO uint16_t*) (Bank1_SDRAM_ADDRESS + Layer + 2*index) = Color;
  } 
}

/**
  * @brief  Sets the cursor position.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position. 
  * @retval None
  */
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
  
  XADDRESS = 2*(Xpos + LCD_PIXEL_WIDTH*Ypos);

}

/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawChar(uint16_t Xpos, uint16_t Ypos, const uint16_t *c)
{
  uint32_t index = 0, i = 0, xpos =0;
  uint32_t  Xaddress = 0;
  
  xpos = Xpos*LCD_PIXEL_WIDTH*2*12;//LCD_Currentfonts->Height;
  Xaddress += LCD_PIXEL_WIDTH - 1 - Ypos;
  
  for(index = 0; index < LCD_Currentfonts->Height; index++)
  {
    
    for(i = 0; i < LCD_Currentfonts->Width; i++)
    {
  
      Bank1_SDRAM_ADDRESS += Layer;
          
      if((((c[index] & ((0x80 << ((LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) &&(LCD_Currentfonts->Width <= 12))||
        (((c[index] & (0x1 << i)) == 0x00)&&(LCD_Currentfonts->Width > 12 )))

      {
          /* Write data value to all SDRAM memory */

         *(__IO uint16_t*) (Bank1_SDRAM_ADDRESS + 2*Xaddress + xpos) = BackColor;

      }
      else
      {
          /* Write data value to all SDRAM memory */

         *(__IO uint16_t*) (Bank1_SDRAM_ADDRESS + 2*Xaddress + xpos) = TextColor;
         
      }
      Xaddress++;
    }
      Xaddress += LCD_PIXEL_WIDTH - LCD_Currentfonts->Width;
  }
}

/**
  * @brief  Displays one character (16dots width, 24dots height).
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  Column: start column address.
  * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
  * @retval None
  */
void LCD_DisplayChar(uint16_t Line, uint16_t Column, uint8_t Ascii)
{
  Ascii -= 32;
  LCD_DrawChar(Line, Column, &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
}

/**
  * @brief  Displays a maximum of 20 char on the LCD.
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  *ptr: pointer to string to display on LCD.
  * @retval None
  */
void LCD_DisplayStringLine(uint16_t Line, uint8_t *ptr)
{
  
  uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;
  uint32_t i = 0;

  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (((refcolumn + 1) & 0xFFFF) >= LCD_Currentfonts->Width))
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Line, refcolumn, *ptr);
    /* Decrement the column position by 16 */
    refcolumn -= LCD_Currentfonts->Width;
    /* Point on the next character */
    ptr++;
    i++;
 
  }
}

/**
  * @brief  Sets a display window
  * @param  Xpos: specifies the X bottom left position.
  * @param  Ypos: specifies the Y bottom left position.
  * @param  Height: display window height.
  * @param  Width: display window width.
  * @retval None
  */
void LCD_SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
  LTDC_Layer_InitTypeDef LTDC_Layer_InitStruct;
  LTDC_Layer_TypeDef     LTDC_Layerx;
  
 if (Layer == LCD_Layer1)
  {       
  LTDC_Layer_InitStruct.LTDC_HorizontalStart = Xpos + 0x2B;
  LTDC_Layer_InitStruct.LTDC_HorizontalStop = (Xpos + Width + 0x2B - 1); 
  LTDC_Layer_InitStruct.LTDC_VarticalStart = Ypos + 0x0C;
  LTDC_Layer_InitStruct.LTDC_VerticalStop = (Ypos + Height + 0x0C - 1);           
  LTDC_Layer_InitStruct.LTDC_PixelFormat = LTDC_Pixelformat_RGB565;
  LTDC_Layer_InitStruct.LTDC_ConstantAlpha = 0xFF;           
  LTDC_Layer_InitStruct.LTDC_DefaultColorBlue = 0x00;        
  LTDC_Layer_InitStruct.LTDC_DefaultColorGreen = 0x00;       
  LTDC_Layer_InitStruct.LTDC_DefaultColorRed = 0x00;         
  LTDC_Layer_InitStruct.LTDC_DefaultColorAlpha = 0x00;       
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_CA;    
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_CA;    
  LTDC_Layer_InitStruct.LTDC_CFBStartAdress = 0xC0000000;
  LTDC_Layer_InitStruct.LTDC_CFBLineLength = ((Width * 2) + 3); 
  LTDC_Layer_InitStruct.LTDC_CFBPitch = (Width * 2);  
  LTDC_Layer_InitStruct.LTDC_CFBLineNumber = Height; 
  LTDC_LayerInit(LTDC_Layer1, &LTDC_Layer_InitStruct);
 }
 else
 {
  LTDC_Layer_InitStruct.LTDC_HorizontalStart = Xpos + 0x2B;
  LTDC_Layer_InitStruct.LTDC_HorizontalStop = (Xpos + Width + 0x2B - 1); 
  LTDC_Layer_InitStruct.LTDC_VarticalStart = Ypos + 0x0C;
  LTDC_Layer_InitStruct.LTDC_VerticalStop = (Ypos + Height + 0x0C - 1);           
  LTDC_Layer_InitStruct.LTDC_PixelFormat = LTDC_Pixelformat_RGB565;
  LTDC_Layer_InitStruct.LTDC_ConstantAlpha = 0xFF;           
  LTDC_Layer_InitStruct.LTDC_DefaultColorBlue = 0x00;        
  LTDC_Layer_InitStruct.LTDC_DefaultColorGreen = 0x00;       
  LTDC_Layer_InitStruct.LTDC_DefaultColorRed = 0x00;         
  LTDC_Layer_InitStruct.LTDC_DefaultColorAlpha = 0x00;       
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_1 = LTDC_BlendingFactor1_CA;    
  LTDC_Layer_InitStruct.LTDC_BlendingFactor_2 = LTDC_BlendingFactor2_CA;    
  LTDC_Layer_InitStruct.LTDC_CFBStartAdress = 0xC00A0000;
  LTDC_Layer_InitStruct.LTDC_CFBLineLength = ((Width * 2) + 3); 
  LTDC_Layer_InitStruct.LTDC_CFBPitch = (Width * 2);  
  LTDC_Layer_InitStruct.LTDC_CFBLineNumber = Height; 
  LTDC_LayerInit(LTDC_Layer2, &LTDC_Layer_InitStruct);   
  }
}

/**
  * @brief  Disables LCD Window mode.
  * @param  None
  * @retval None
  */
void LCD_WindowModeDisable(void)
{
  LCD_SetDisplayWindow(0, 0, LCD_PIXEL_HEIGHT, LCD_PIXEL_WIDTH);
  
}

/**
  * @brief  Displays a line.
  * @param Xpos: specifies the X position.
  * @param Ypos: specifies the Y position.
  * @param Length: line length.
  * @param Direction: line direction.
  *   This parameter can be one of the following values: Vertical or Horizontal.
  * @retval None
  */
void LCD_DrawLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length, uint8_t Direction)
{
    DMA2D_InitTypeDef      DMA2D_InitStruct;
  
    uint32_t  Xaddress = 0;
    uint16_t Red_Value = 0, Green_Value = 0, Blue_Value = 0;
  
  Xaddress = 0xC0000000 + Layer + 2*(LCD_PIXEL_WIDTH*Ypos + Xpos);
 
