jfazli/PE208/F429HMIPlatform-bsp/Utilities/STM32_EVAL/STM3240_41_G_EVAL/stm324xx_eval_lcd.c
  Red_Value = (0xF800 & TextColor) >> 11;
  Blue_Value = 0x001F & TextColor;
  Green_Value = (0x07E0 & TextColor) >> 5;

  if(Direction == LCD_DIR_HORIZONTAL)
  {    
  DMA2D_DeInit();  
  DMA2D_InitStruct.DMA2D_Mode = DMA2D_R2M;       
  DMA2D_InitStruct.DMA2D_CMode = DMA2D_RGB565;      
  DMA2D_InitStruct.DMA2D_OutputGreen = Green_Value;      
  DMA2D_InitStruct.DMA2D_OutputBlue = Blue_Value;     
  DMA2D_InitStruct.DMA2D_OutputRed = Red_Value;                
  DMA2D_InitStruct.DMA2D_OutputAlpha = 0x0F;                  
  DMA2D_InitStruct.DMA2D_OutputMemoryAdd = Xaddress;                
  DMA2D_InitStruct.DMA2D_OutputOffset = 0;                
  DMA2D_InitStruct.DMA2D_NumberOfLine = 1;            
  DMA2D_InitStruct.DMA2D_PixelPerLine = Length;
  DMA2D_Init(&DMA2D_InitStruct); 
  
    /* Start Transfer */ 
  DMA2D_StartTransfer();
  
  /* Wait for CTC Flag activation */
  while(DMA2D_GetFlagStatus(DMA2D_FLAG_TC) == RESET)
  {
  } 
  
  }
  else
  {
  DMA2D_DeInit();
  DMA2D_InitStruct.DMA2D_Mode = DMA2D_R2M;       
  DMA2D_InitStruct.DMA2D_CMode = DMA2D_RGB565;      
  DMA2D_InitStruct.DMA2D_OutputGreen = Green_Value;      
  DMA2D_InitStruct.DMA2D_OutputBlue = Blue_Value;     
  DMA2D_InitStruct.DMA2D_OutputRed = Red_Value;                
  DMA2D_InitStruct.DMA2D_OutputAlpha = 0x0F;                  
  DMA2D_InitStruct.DMA2D_OutputMemoryAdd = Xaddress;                
  DMA2D_InitStruct.DMA2D_OutputOffset = LCD_PIXEL_WIDTH - 1;                
  DMA2D_InitStruct.DMA2D_NumberOfLine = Length;            
  DMA2D_InitStruct.DMA2D_PixelPerLine = 1;
  DMA2D_Init(&DMA2D_InitStruct); 
  
    /* Start Transfer */ 
  DMA2D_StartTransfer();
  
  /* Wait for CTC Flag activation */
  while(DMA2D_GetFlagStatus(DMA2D_FLAG_TC) == RESET)
  {
  } 
  
  }  

}

/**
  * @brief  Displays a rectangle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: display rectangle height.
  * @param  Width: display rectangle width.
  * @retval None
  */
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
  LCD_DrawLine(Xpos, Ypos, Width, LCD_DIR_HORIZONTAL);
  LCD_DrawLine(Xpos, (Ypos+ Height), Width, LCD_DIR_HORIZONTAL);
  
  LCD_DrawLine(Xpos, Ypos, Height, LCD_DIR_VERTICAL);
  LCD_DrawLine((Xpos + Width), Ypos, Height, LCD_DIR_VERTICAL);
}


void LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
    int x = -Radius, y = 0, err = 2-2*Radius, e2;
    uint32_t Xaddress = Bank1_SDRAM_ADDRESS + Layer;
    do {
        *(__IO uint16_t*) (Xaddress + (2*((Xpos-x) + LCD_PIXEL_WIDTH*(Ypos+y)))) = TextColor; 
        *(__IO uint16_t*) (Xaddress + (2*((Xpos+x) + LCD_PIXEL_WIDTH*(Ypos+y)))) = TextColor;
        *(__IO uint16_t*) (Xaddress + (2*((Xpos+x) + LCD_PIXEL_WIDTH*(Ypos-y)))) = TextColor;
        *(__IO uint16_t*) (Xaddress + (2*((Xpos-x) + LCD_PIXEL_WIDTH*(Ypos-y)))) = TextColor;
      
        e2 = err;
        if (e2 <= y) {
            err += ++y*2+1;
            if (-x == y && e2 <= x) e2 = 0;
        }
        if (e2 > x) err += ++x*2+1;
    }
    while (x <= 0);
}

void LCD_DrawFullEllipse(int Xpos, int Ypos, int Radius, int Radius2)
{
    int x = -Radius, y = 0, err = 2-2*Radius, e2;
    uint32_t Xaddress = Bank1_SDRAM_ADDRESS + Layer;
    float K = 0, rad1 = 0, rad2 = 0;
    
    
    rad1 = Radius;
    rad2 = Radius2;

      if (Radius > Radius2)
      { 
        do {
        K = (float)(rad1/rad2);
        LCD_DrawLine((Xpos+x), (Ypos-(uint16_t)(y/K)), (2*(uint16_t)(y/K) + 1), LCD_DIR_VERTICAL);
        LCD_DrawLine((Xpos-x), (Ypos-(uint16_t)(y/K)), (2*(uint16_t)(y/K) + 1), LCD_DIR_VERTICAL);

        e2 = err;
        if (e2 <= y) {
            err += ++y*2+1;
            if (-x == y && e2 <= x) e2 = 0;
        }
        if (e2 > x) err += ++x*2+1;
        
    }
    while (x <= 0);
      }
      else
      {
        y = -Radius2; 
        x = 0;
       do { 
        K = (float)(rad2/rad1);
        
        LCD_DrawLine((Xpos-(uint16_t)(x/K)), (Ypos+y), (2*(uint16_t)(x/K) + 1), LCD_DIR_HORIZONTAL);
        LCD_DrawLine((Xpos-(uint16_t)(x/K)), (Ypos-y), (2*(uint16_t)(x/K) + 1), LCD_DIR_HORIZONTAL);

        e2 = err;
        if (e2 <= x) {
            err += ++x*2+1;
            if (-y == x && e2 <= y) e2 = 0;
        }
        if (e2 > y) err += ++y*2+1;
    }
    while (y <= 0);
    }
}

/**
  * @brief  Displays an Ellipse.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius: specifies Radius.
  * @param  Radius2: specifies Radius2.
  * @retval None
  */

void LCD_DrawEllipse(int Xpos, int Ypos, int Radius, int Radius2)
{
    int x = -Radius, y = 0, err = 2-2*Radius, e2;
    uint32_t Xaddress = Bank1_SDRAM_ADDRESS + Layer;
    float K = 0, rad1 = 0, rad2 = 0;
    
    
    rad1 = Radius;
    rad2 = Radius2;

      if (Radius > Radius2)
      { 
        do {
        K = (float)(rad1/rad2);
        *(__IO uint16_t*) (Xaddress + (2*((Xpos-x) + LCD_PIXEL_WIDTH*(Ypos+(uint16_t)(y/K))))) = TextColor; 
        *(__IO uint16_t*) (Xaddress + (2*((Xpos+x) + LCD_PIXEL_WIDTH*(Ypos+(uint16_t)(y/K))))) = TextColor;
        *(__IO uint16_t*) (Xaddress + (2*((Xpos+x) + LCD_PIXEL_WIDTH*(Ypos-(uint16_t)(y/K))))) = TextColor;
        *(__IO uint16_t*) (Xaddress + (2*((Xpos-x) + LCD_PIXEL_WIDTH*(Ypos-(uint16_t)(y/K))))) = TextColor;


        e2 = err;
        if (e2 <= y) {
            err += ++y*2+1;
            if (-x == y && e2 <= x) e2 = 0;
        }
        if (e2 > x) err += ++x*2+1;
    }
    while (x <= 0);
      }
      else
      {
        y = -Radius2; 
        x = 0;
       do { 
        K = (float)(rad2/rad1);
        *(__IO uint16_t*) (Xaddress + (2*((Xpos-(uint16_t)(x/K)) + LCD_PIXEL_WIDTH*(Ypos+y)))) = TextColor; 
        *(__IO uint16_t*) (Xaddress + (2*((Xpos+(uint16_t)(x/K)) + LCD_PIXEL_WIDTH*(Ypos+y)))) = TextColor;
        *(__IO uint16_t*) (Xaddress + (2*((Xpos+(uint16_t)(x/K)) + LCD_PIXEL_WIDTH*(Ypos-y)))) = TextColor;
        *(__IO uint16_t*) (Xaddress + (2*((Xpos-(uint16_t)(x/K)) + LCD_PIXEL_WIDTH*(Ypos-y)))) = TextColor;

        e2 = err;
        if (e2 <= x) {
            err += ++x*2+1;
            if (-y == x && e2 <= y) e2 = 0;
        }
        if (e2 > y) err += ++y*2+1;
        
